Repository: MattisBrizard/flutter-wordle-puzzle-hack
Catalog: lib/src/l10n/arb/app_*.arb
Languages: fr

source: Show settings
fr: Ouvrir les réglages

source: Show how to play
fr: Ouvrir comment jouer

source: Reset puzzle
fr: Réinitialiser le puzzle

# number_of_moves
source: {count,plural, =0{{count} move} =1{{count} move} other{{count} moves}}
fr: {count,plural, =0{{count} coup} =1{{count} coup} other{{count} coups}}

# number_of_correct_tiles
source: {count,plural, =0{{count} tile} =1{{count} tile} other{{count} tiles}}
fr: {count,plural, =0{{count} tuile} =1{{count} tuile} other{{count} tuiles}}

# in_number_of_moves
source: in {count} moves
fr: en {count} coups

source: Restart
fr: Recommencer

source: How to play?
fr: Comment jouer ?

source: Examples
fr: Exemples

# gameplay_description
source: This game is a mix of Wordle and the Slide Puzzle. The goal is to find the words by moving the tiles. The tiles will change color based on their positions.
fr: Ce jeu est un mix entre Wordle et le Sliding Puzzle. L'objectif est de retrouver les mots en bougeant les tuiles. Les tuiles changent de couleurs selon leurs positions.

# scrabble_valid_description
source: All words are Scrabble valid.
fr: Tous les mots sont valides au Scrabble.

# word_example
source: brain
fr: poire

# letter_in_word_description
source: The letter {letter} is in the word, but at the wrong position.
fr: La lettre {letter} est dans le mot, mais à la mauvaise position.

# letter_correct_position_description
source: The letter {letter} is in the word, at the right position.
fr: La lettre {letter} est dans le mot, à la bonne place.

# letters_not_in_word_description
source: The letters are not in word.
fr: Les lettres ne sont pas dans le mot.

# letters_unauthorized_position_description
source: The letter {firstLetter} is in the word and at the right position, but it's not the right one, you have to position another {firstLetter} letter in order to complete the puzzle. Same for {secondLetter} but with the wrong position.
fr: La lettre {firstLetter} est dans le mot et à la bonne position, mais ce n'est pas la bonne lettre. Vous devez positionner une autre lettre {firstLetter} pour pouvoir compléter le puzzle. Idem pour la lettre {secondLetter} mais qui est à la mauvaise position.

source: Settings
fr: Réglages

source: Credits
fr: Crédits

source: Color-blind mode
fr: Mode daltonien

source: Change locale
fr: Changer la langue

source: Update gradient
fr: Changer le dégradé

# credits_developed_by
source: Developed by Mattis Brizard.
fr: Dévelopé par Mattis Brizard.

# credits_inspired_by
source: Inspired by Wordle.
fr: Inspiré par Wordle.

# credits_based_on
source: Based on the Very Good Ventures Slide Puzzle example.
fr: Basé sur l'exemple Slide Puzzle par Very Good Ventures.
